### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cms_function_app.azurerm_storage_container.activations will be created
  + resource "azurerm_storage_container" "activations" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "activations"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "iopitnsvccmsst01"
    }

  # module.cms_function_app.azurerm_storage_management_policy.move_activations will be created
  + resource "azurerm_storage_management_policy" "move_activations" {
      + id                 = (known after apply)
      + storage_account_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsst01"

      + rule {
          + enabled = true
          + name    = "move-version-to-archive"

          + actions {
              + version {
                  + change_tier_to_archive_after_days_since_creation               = 0
                  + change_tier_to_cool_after_days_since_creation                  = -1
                  + delete_after_days_since_creation                               = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
            }

          + filters {
              + blob_types   = [
                  + "blockBlob",
                ]
              + prefix_match = [
                  + "activations/",
                ]
            }
        }
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsst01"
        name                               = "iopitnsvccmsst01"
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (97 unchanged attributes hidden)

      ~ blob_properties {
          ~ versioning_enabled            = false -> true
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.cms_function_app.module.adf_to_blob_data_reader_db.module.storage_account.azurerm_role_assignment.blob["iopitnsvccmsst01|activations|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + description                      = "To allow migrating the activations of special services's"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f8bbc97-e5bc-4cbf-a364-f09ddf1ac7ce"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsst01/blobServices/default/containers/activations"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>
